package 자바1일차_자바특징;
/*
 * 1page
 * 1995년도 5월 23일 자바 탄생
 * ----------------------- Java Applet (동적=>브라우저)
 * 이전 => 자바(게임기) => 세븐스타(도크) => 임베디드 => 모바일
 * ---- 리모콘(통합 => 그린 프로젝트 => 제임스 고슬링 / 아서 벤)
 * ---- 후원금이 없어서 망함
 * ---- 인수업체 => 네스케이프 => 자바스크립트 => 웹프로그램 발전
 * 
 * 1995년도 5월 23일 자바 탄생 : 자바
 * MySql을 인수 => 부도 => 오라클이 인수 : 자바를 유료화
 * 제임스 고슬링 => 연봉협상 => 구글 (Go언어)
 * 
 * 1970        / 1980
 * ----------    ------------
 *  C(절차지향)     C++(C With Class, 객체지향) ==> Java(단순화)
 *                                             ------------ CDB
 */
public class 자바특징 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
