/*
 * 대입연산자
 * 연산순서 (우에서 좌로)
 * 
 * 우->좌
 * a=10+30
 *    <-
 *   
 *   =   대입연산자
 *   ------------- 복합대입연산자
 *   ***+= => 누적(총합)
 *   ***-= => 
 *   *=
 *   /=
 *   %=
 *   <<=
 *   >>=
 *   &=
 *   |=
 *   ^=
 *   --------------
 *   
 *   +=
 *   ---
 *   int a=10;
 *   a+=10;   ===> a=a+10 => 20
 *   a+=1;  a=a+1 a++ ++a
 *   -----------------------------
 *   a+=20  a=a+20 => 30
 *   a-=20  a=a-20 => -10
 *   a*=10  a=a*10 => 100
 *   a/=10  a=a/10 => 1
 *   a%=2   a=a%2  => 0
 *   
 */
public class 대입연산자 {

	public static void main(String[] args) {
		
//		int a=10;
//		a++;
//		a++;
//		a++;
//		System.out.println(a);

//		int a=10;
//		a+=3;
//		System.out.println(a);

//		int a=10;
//		a=a+3;
//		System.out.println(a);
		
		
	}

}
