/*
 * 1. 단일 조건문
 *     형식 )
 *         if (조건문) {
 *             조건문이 true면 수행하는 문장 작성
 *             ------- 부정연산자 ( ! ), 비교연산자 ( ==, !=, <, >, <=, >= )
 *                        논리연산자 ( &&, || )만 사용이 가능
 *         }
 * 2. 선택 조건문
 *     if (조건문) {
 *         조건문이 true면 수행하는 문장 작성
 *     } else {
 *         조건문이 false면 수행하는 문장 작성
 *     } => else문장은 바로 위에 있는 if문 소속이다.
 *     
 *     if () {
 *     
 *     }
 *     ----------
 *     if () {
 *     
 *     } else {
 *     
 *     }
 *     ----------
 *     => else문은 단독으로는 사용할 수 없다 (if를 반드시 사용)
 * 3. 다중 조건문
 *     if (조건문) {
 *         // 조건문이 true일 때 처리 => 종료
 *         // 조건문이 false일 때 => 다음 조건을 찾는다
 *     } else if (조건문) {
 *         // 조건문이 true일 때 처리 => 종료
 *         // 조건문이 false일 때 => 다음 조건을 찾는다
 *     } else {
 *         // 해당 조건이 없는 경우
 *     }
 * 4. 선택문
 * 5. 반복문 ( for-1차)
 */
public class 제어문_정리 {

	public static void main(String[] args) {

	}

}
